In [1]:
import pandas as pd

In [5]:
obj = pd.Series([11, 12, 13, 14, 15])

In [6]:
obj

0    11
1    12
2    13
3    14
4    15
dtype: int64

In [8]:
obj.values

array([11, 12, 13, 14, 15], dtype=int64)

In [10]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
obj1 = pd.Series([13, 25, 56, 78], index=['a', 'b', 'c', 'd'])
obj1

a    13
b    25
c    56
d    78
dtype: int64

In [12]:
obj1['b']

25

In [13]:
obj1['d']

78

In [14]:
del obj1['c']

In [15]:
obj1

a    13
b    25
d    78
dtype: int64

In [16]:
obj1['e'] = 76

In [17]:
obj1

a    13
b    25
d    78
e    76
dtype: int64

In [23]:
items = ['Red', 'Green' ,'Yellow', 'Purple', 'White', 'Black']
indexes = [1, 2, 3, 4, 5, 6]

obj2 = pd.Series(items, indexes)

In [24]:
obj2

1       Red
2     Green
3    Yellow
4    Purple
5     White
6     Black
dtype: object

In [25]:
del obj2[4]

In [26]:
obj2

1       Red
2     Green
3    Yellow
5     White
6     Black
dtype: object

In [27]:
obj2[7] = "Brown"

In [28]:
obj2

1       Red
2     Green
3    Yellow
5     White
6     Black
7     Brown
dtype: object

In [31]:
obj2 * 2

1          RedRed
2      GreenGreen
3    YellowYellow
5      WhiteWhite
6      BlackBlack
7      BrownBrown
dtype: object

In [32]:
obj2.index * 2

Int64Index([2, 4, 6, 10, 12, 14], dtype='int64')

In [38]:
obj3 = pd.Series(['shakeel', 'sameer', 'shabbir', 'shahid', 'salman'], index=range(5))

In [39]:
obj3

0    shakeel
1     sameer
2    shabbir
3     shahid
4     salman
dtype: object

In [40]:
obj3[2:]

2    shabbir
3     shahid
4     salman
dtype: object

In [43]:
obj3[2:]

2    shabbir
3     shahid
4     salman
dtype: object

In [44]:
obj3=='shakeel'

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [49]:
21 in obj3

False

In [50]:
'shakeel' in obj3

False

In [51]:
obj4 = pd.Series([11, 12, 13, 14, 13, 14, 15], index=range(7))

In [52]:
obj4

0    11
1    12
2    13
3    14
4    13
5    14
6    15
dtype: int64

### Creating series using python dictionary

In [53]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [54]:
s1 = pd.Series(sdata)

In [55]:
s1

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [56]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [57]:
s2 = pd.Series(sdata, index=states)

In [58]:
s2

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [59]:
pd.isnull(s2) #notnull(s2)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [60]:
s2[pd.isnull(s2)]

California   NaN
dtype: float64

In [61]:
s1 * s2

California             NaN
Ohio          1.225000e+09
Oregon        2.560000e+08
Texas         5.041000e+09
Utah                   NaN
dtype: float64

In [62]:
s2.name = 'countries'

In [63]:
s2

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: countries, dtype: float64

In [64]:
obj4

0    11
1    12
2    13
3    14
4    13
5    14
6    15
dtype: int64

In [65]:
#changing indexes
obj4.index = ['a', 'b', 'c', 'd', 'e', 'f', 'g']

In [66]:
obj4

a    11
b    12
c    13
d    14
e    13
f    14
g    15
dtype: int64

In [67]:
#changing series name
obj4.name = 'object 4'

In [68]:
obj4

a    11
b    12
c    13
d    14
e    13
f    14
g    15
Name: object 4, dtype: int64

In [71]:
obj4.dtype

dtype('int64')

# Data Frames

In [72]:
data = { 'state' : ['ohio', 'ohio', 'ohio', 'neveda', 'neveda', 'neveda'],
        'year' : [2000, 2001, 2002, 2003, 2000, 2001],
        'pop' : [1.5, 1.7, 3.6, 2.4, 2.0, 3.2]
       }

In [73]:
df = pd.DataFrame(data)

In [74]:
df

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  neveda  2003  2.4
4  neveda  2000  2.0
5  neveda  2001  3.2

In [75]:
df.head()

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  neveda  2003  2.4
4  neveda  2000  2.0

In [77]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2003  neveda  2.4
4  2000  neveda  2.0
5  2001  neveda  3.2

In [78]:
df.shape

(6, 3)

In [79]:
type(df)

pandas.core.frame.DataFrame

In [80]:
# pd.read_csv("dash.csv")

In [81]:
df.head(3)

  state  year  pop
0  ohio  2000  1.5
1  ohio  2001  1.7
2  ohio  2002  3.6

In [83]:
df.tail(3)

    state  year  pop
3  neveda  2003  2.4
4  neveda  2000  2.0
5  neveda  2001  3.2

In [84]:
df.size

18

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
state    6 non-null object
year     6 non-null int64
pop      6 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 224.0+ bytes

In [87]:
df.describe()

              year       pop
count     6.000000  6.000000
mean   2001.166667  2.400000
std       1.169045  0.841427
min    2000.000000  1.500000
25%    2000.250000  1.775000
50%    2001.000000  2.200000
75%    2001.750000  3.000000
max    2003.000000  3.600000

In [88]:
df.columns

Index(['state', 'year', 'pop'], dtype='object')

In [89]:
df['state']

0      ohio
1      ohio
2      ohio
3    neveda
4    neveda
5    neveda
Name: state, dtype: object

In [93]:
df['state'][2:5]

2      ohio
3    neveda
4    neveda
Name: state, dtype: object

In [97]:
df[['state', 'year']][0:2]

  state  year
0  ohio  2000
1  ohio  2001

In [98]:
df.year

0    2000
1    2001
2    2002
3    2003
4    2000
5    2001
Name: year, dtype: int64

In [100]:
df.year[3]

2003

In [101]:
df.loc[3]

state    neveda
year       2003
pop         2.4
Name: 3, dtype: object

In [102]:
frame2 = pd.DataFrame(data, columns=['state', 'year', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five', 'six'])

In [103]:
frame2

        state  year  pop debt
one      ohio  2000  1.5  NaN
two      ohio  2001  1.7  NaN
three    ohio  2002  3.6  NaN
four   neveda  2003  2.4  NaN
five   neveda  2000  2.0  NaN
six    neveda  2001  3.2  NaN

In [104]:
frame2.debt = [ 100, 200, 300, 900, 150, 180]

In [105]:
frame2

        state  year  pop  debt
one      ohio  2000  1.5   100
two      ohio  2001  1.7   200
three    ohio  2002  3.6   300
four   neveda  2003  2.4   900
five   neveda  2000  2.0   150
six    neveda  2001  3.2   180

In [118]:
frame2['debt'].loc[3] = 750

In [119]:
frame2

        state  year  pop  debt
one      ohio  2000  1.5   100
two      ohio  2001  1.7   200
three    ohio  2002  3.6   500
four   neveda  2003  2.4   900
five   neveda  2000  2.0   150
six    neveda  2001  3.2   180

In [120]:
frame2.columns

Index(['state', 'year', 'pop', 'debt'], dtype='object')

In [121]:
frame2.year

one      2000
two      2001
three    2002
four     2003
five     2000
six      2001
Name: year, dtype: int64

In [123]:
frame2['year'].head(2)

one    2000
two    2001
Name: year, dtype: int64

In [124]:
frame2.year.tail(2)

five    2000
six     2001
Name: year, dtype: int64

In [126]:
frame2[['state', 'pop']].head(3)

      state  pop
one    ohio  1.5
two    ohio  1.7
three  ohio  3.6

In [130]:
frame2[['state', 'pop']].loc['three']

state    ohio
pop       3.6
Name: three, dtype: object

In [132]:
frame2[['state', 'pop']].iloc[2]

state    ohio
pop       3.6
Name: three, dtype: object

In [133]:
frame2[['state', 'pop']].loc[['three', 'one']]

      state  pop
three  ohio  3.6
one    ohio  1.5

In [134]:
col = ['state', 'pop', 'debt']
row = ['one', 'three', 'five']
frame2[col].loc[row]

        state  pop  debt
one      ohio  1.5   100
three    ohio  3.6   500
five   neveda  2.0   150

In [135]:
val = pd.Series([-1.5, -1.7, -2.8], index=['one', 'three', 'five'])

In [136]:
frame2.debt = val

In [137]:
frame2

        state  year  pop  debt
one      ohio  2000  1.5  -1.5
two      ohio  2001  1.7   NaN
three    ohio  2002  3.6  -1.7
four   neveda  2003  2.4   NaN
five   neveda  2000  2.0  -2.8
six    neveda  2001  3.2   NaN

In [139]:
frame2[frame2.isnull()]

      state  year  pop  debt
one     NaN   NaN  NaN   NaN
two     NaN   NaN  NaN   NaN
three   NaN   NaN  NaN   NaN
four    NaN   NaN  NaN   NaN
five    NaN   NaN  NaN   NaN
six     NaN   NaN  NaN   NaN

In [146]:
frame2

        state  year  pop  debt
one      ohio  2000  1.5  -1.5
two      ohio  2001  1.7   NaN
three    ohio  2002  3.6  -1.7
four   neveda  2003  2.4   NaN
five   neveda  2000  2.0  -2.8
six    neveda  2001  3.2   NaN

In [147]:
frame2['eastern'] = frame2.state == 'ohio'

In [149]:
frame2

        state  year  pop  debt  eastern
one      ohio  2000  1.5  -1.5     True
two      ohio  2001  1.7   NaN     True
three    ohio  2002  3.6  -1.7     True
four   neveda  2003  2.4   NaN    False
five   neveda  2000  2.0  -2.8    False
six    neveda  2001  3.2   NaN    False

In [150]:
frame2.T

          one   two three    four    five     six
state    ohio  ohio  ohio  neveda  neveda  neveda
year     2000  2001  2002    2003    2000    2001
pop       1.5   1.7   3.6     2.4       2     3.2
debt     -1.5   NaN  -1.7     NaN    -2.8     NaN
eastern  True  True  True   False   False   False

In [151]:
frame2

        state  year  pop  debt  eastern
one      ohio  2000  1.5  -1.5     True
two      ohio  2001  1.7   NaN     True
three    ohio  2002  3.6  -1.7     True
four   neveda  2003  2.4   NaN    False
five   neveda  2000  2.0  -2.8    False
six    neveda  2001  3.2   NaN    False

In [152]:
frame2.debt[['two', 'four', 'six']] = [5.1, 5.2, 5.3]

C:\Users\Haider\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [153]:
frame2

        state  year  pop  debt  eastern
one      ohio  2000  1.5  -1.5     True
two      ohio  2001  1.7   5.1     True
three    ohio  2002  3.6  -1.7     True
four   neveda  2003  2.4   5.2    False
five   neveda  2000  2.0  -2.8    False
six    neveda  2001  3.2   5.3    False

In [154]:
frame2['debt'].loc[['two', 'four', 'six']] = [6.1, 6.2, 6.3]

C:\Users\Haider\Anaconda3\lib\site-packages\pandas\core\indexing.py:190: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [155]:
frame2

        state  year  pop  debt  eastern
one      ohio  2000  1.5  -1.5     True
two      ohio  2001  1.7   6.1     True
three    ohio  2002  3.6  -1.7     True
four   neveda  2003  2.4   6.2    False
five   neveda  2000  2.0  -2.8    False
six    neveda  2001  3.2   6.3    False

In [157]:
score = { 'python1' : [67, 89, 99, 31, 56, 88, 72],
        'python2' : [76, 87, 56, 78, 43, 87, 88],
        'AI' : [87, 65, 77, 76, 99, 65, 56]}

In [158]:
studentdata = pd.DataFrame(score)

In [159]:
studentdata

   python1  python2  AI
0       67       76  87
1       89       87  65
2       99       56  77
3       31       78  76
4       56       43  99
5       88       87  65
6       72       88  56

In [161]:
studentdata['total'] = studentdata.python1 + studentdata.python2 + studentdata.AI

In [162]:
studentdata

   python1  python2  AI  total
0       67       76  87    230
1       89       87  65    241
2       99       56  77    232
3       31       78  76    185
4       56       43  99    198
5       88       87  65    240
6       72       88  56    216

In [183]:
import numpy as np
studentdata['status'] = np.where(studentdata.total >= 200,'Pass', 'Failed')

In [184]:
studentdata

   python1  python2  AI  total  status status2
0       67       76  87    230    Pass    Pass
1       89       87  65    241    Pass    Pass
2       99       56  77    232    Pass    Pass
3       31       78  76    185  Failed  Failed
4       56       43  99    198  Failed  Failed
5       88       87  65    240    Pass    Pass
6       72       88  56    216    Pass    Pass

In [181]:
studentdata['status2'] = ["Pass" if i>=200 else "Failed" for i in studentdata.total]

In [182]:
studentdata

   python1  python2  AI  total  status status2
0       67       76  87    230    pass    Pass
1       89       87  65    241    pass    Pass
2       99       56  77    232    pass    Pass
3       31       78  76    185  failed  Failed
4       56       43  99    198  failed  Failed
5       88       87  65    240    pass    Pass
6       72       88  56    216    pass    Pass